{
    "items":  [
                  {
                      "title":  "Australia’s workers reaping greater share of national income than before pandemic",
                      "url":  "https://www.theguardian.com/business/2025/sep/15/australian-workers-reaping-greater-share-national-income-than-before-pandemic",
                      "summary":  "Westpac economist says tighter labour market is behind changes in how the ‘economic pie’ is divided Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast Workers are now receiving more of the “ economic pie ” than before the pandemic, with the increase in labour’s share of national income delivering an extra $28bn into the pockets of Australians over the past year alone. Pat Bustamante, a senior economist at Westpac, said his analysis suggested that the tighter post-Covid labour market was behind the greater share going to workers, from an average of 53.8% through the 2010s, to more than 55% now. Continue reading...",
                      "published_at":  "2025-09-14T15:00:37+00:00",
                      "source":  "World news | The Guardian",
                      "clickbait_prob":  0.0021428571428571425,
                      "ragebait_prob":  0.004999999999999999,
                      "score":  99.7
                  },
                  {
                      "title":  "Nepal prime minister quits after deaths at protests sparked by social media ban",
                      "url":  "https://www.theguardian.com/world/2025/sep/09/nepal-protests-social-media-ban-lifted-gen-z-kathmandu",
                      "summary":  "KP Sharma Oli resigns as police meet protests with deadly force, leaving 19 dead, and federal parliament is set alight Nepal’s prime minister has resigned after some of the worst unrest in decades rocked the country this week, set off by a ban on social media and discontent at political corruption and nepotism. KP Sharma Oli’s resignation came a day after widespread protests were met with deadly force by police, leaving 19 dead and hundreds injured. The spark for the protests was a government ban on 26 prominent social media apps, but escalated into a larger mass movement against corruption among political elites. Continue reading...",
                      "published_at":  "2025-09-09T12:50:23+00:00",
                      "source":  "World news | The Guardian",
                      "clickbait_prob":  0.0022388059701492534,
                      "ragebait_prob":  0.005223880597014925,
                      "score":  99.68656716417911
                  },
                  {
                      "title":  "Junk food leads to more children being obese than underweight for first time",
                      "url":  "https://www.theguardian.com/global-development/2025/sep/10/junk-food-upf-more-children-obese-than-underweight-unicef",
                      "summary":  "Cheap ultra-processed food behind rise in overweight children, with one in 10 now obese globally, says Unicef More children around the world are obese than underweight for the first time, according to a UN report that warns ultra-processed junk food is overwhelming childhood diets. There are 188 million teenagers and school-age children with obesity – one in 10 – Unicef said, affecting health and development and bringing a risk of life-threatening diseases. Continue reading...",
                      "published_at":  "2025-09-09T23:01:54+00:00",
                      "source":  "World news | The Guardian",
                      "clickbait_prob":  0.00234375,
                      "ragebait_prob":  0.00546875,
                      "score":  99.671875
                  },
                  {
                      "title":  "\u0027Hatton was the people\u0027s champion who fought with every part of his soul\u0027",
                      "url":  "https://www.bbc.com/sport/boxing/articles/c5ykrlg9dxzo?at_medium=RSS\u0026at_campaign=rss",
                      "summary":  "British boxer Ricky Hatton is remembered as a \"warrior\" who became the \"people\u0027s champion\" as the sporting world reacts to his death.",
                      "published_at":  "2025-09-14T16:24:50+00:00",
                      "source":  "BBC News",
                      "clickbait_prob":  0.002586206896551724,
                      "ragebait_prob":  0.00603448275862069,
                      "score":  99.63793103448276
                  },
                  {
                      "title":  "Global press freedom suffers sharpest fall in 50 years, report finds",
                      "url":  "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
                      "summary":  "The International IDEA’s survey of democratic markers finds US is offering ‘encouragement’ to populist leaders Press freedom around the world has suffered its sharpest fall in 50 years as global democracy weakens dramatically, a landmark report has found. According to the Stockholm-based International Institute for Democracy and Electoral Assistance (IDEA) , democracy has declined in 94 countries over the last five years and only a third have made progress. Continue reading...",
                      "published_at":  "2025-09-10T23:01:16+00:00",
                      "source":  "World news | The Guardian",
                      "clickbait_prob":  0.002727272727272727,
                      "ragebait_prob":  0.006363636363636363,
                      "score":  99.61818181818182
                  },
                  {
                      "title":  "Millions of Australians at risk from rising sea levels and heat deaths to soar, national climate risk assessment report warns",
                      "url":  "https://www.theguardian.com/australia-news/2025/sep/15/millions-of-australians-at-risk-from-rising-sea-levels-and-heat-deaths-could-soar-landmark-climate-report-warns",
                      "summary":  "National climate risk assessment report finds heat-related deaths would surge 450% in Sydney if global heating surpasses 3C Follow our Australia news live blog for latest updates Get our breaking news email , free app or daily news podcast The number of heat-related deaths in Sydney could surge by almost 450% if global heating surpasses 3C, according to a landmark report that finds no Australian community would be immune from the “cascading, compounding and concurrent” risks of a worsening climate. The report also lays bare the heightened risk from rising sea levels on Australia’s populous coastal communities, including flooding, erosion and inundation. Continue reading...",
                      "published_at":  "2025-09-15T00:01:45+00:00",
                      "source":  "World news | The Guardian",
                      "clickbait_prob":  0.002857142857142857,
                      "ragebait_prob":  0.006666666666666667,
                      "score":  99.6
                  },
                  {
                      "title":  "Australia approves vaccine to protect koalas from chlamydia",
                      "url":  "https://www.npr.org/2025/09/14/nx-s1-5541358/australia-koala-chlamydia-vaccine",
                      "summary":  "Chlamydia in koalas can cause blindness, infertility and even death.",
                      "published_at":  "2025-09-15T00:11:23+00:00",
                      "source":  "NPR Topics: News",
                      "clickbait_prob":  0.0028846153846153848,
                      "ragebait_prob":  0.006730769230769231,
                      "score":  99.59615384615384
                  },
                  {
                      "title":  "Children and teenagers share impact of pandemic in new report",
                      "url":  "https://www.bbc.com/news/articles/cx2jll1wx4ko?at_medium=RSS\u0026at_campaign=rss",
                      "summary":  "Children describe positive memories of family time, as well as the darker side of pandemic life online.",
                      "published_at":  "2025-09-14T23:14:25+00:00",
                      "source":  "BBC News",
                      "clickbait_prob":  0.0028846153846153848,
                      "ragebait_prob":  0.006730769230769231,
                      "score":  99.59615384615384
                  },
                  {
                      "title":  "Kirk suspect \u0027not co-operating\u0027 with authorities, governor says",
                      "url":  "https://www.bbc.com/news/articles/c4gvrw2pgedo?at_medium=RSS\u0026at_campaign=rss",
                      "summary":  "He adds that \"much more evidence and information\" will become available once charges are filed in the case.",
                      "published_at":  "2025-09-14T18:14:36+00:00",
                      "source":  "BBC News",
                      "clickbait_prob":  0.0028846153846153848,
                      "ragebait_prob":  0.006730769230769231,
                      "score":  99.59615384615384
                  },
                  {
                      "title":  "Kirk shooting suspect had ‘very different ideology’ than conservative family, Utah governor says",
                      "url":  "https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate",
                      "summary":  "\u003cp\u003eSpencer Cox says suspect, who isn’t cooperating with officials, had been ‘radicalized’ and was in relationship with person transitioning from male to female\u003c/p\u003e\u003cp\u003eThe \u003ca href=\"https://www.theguardian.com/us-news/utah\"\u003eUtah\u003c/a\u003e governor, Spencer Cox, on Sunday told national talkshows that the man suspected of \u003ca href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\"\u003ekilling\u003c/a\u003e Turning Point USA executive director \u003ca href=\"https://www.theguardian.com/us-news/2025/sep/10/who-is-charlie-kirk-profile\"\u003eCharlie Kirk\u003c/a\u003e was living with and in a relationship with a person “transitioning from male to female” as investigators continue exploring a possible motive in the attack.\u003c/p\u003e\u003cp\u003eThe Republican politician’s comments came four days after Kirk – a \u003ca href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-quotes-beliefs\"\u003ecritic\u003c/a\u003e of gay and transgender rights – was shot to death from a distance with a rifle during an event at Utah Valley University shortly after asserting that “too many” trans people had committed mass shootings in the US. In reality, according to what the nonpartisan Gun Violence Archive \u003ca href=\"https://www.nbcnews.com/tech/internet/madison-school-shooting-shooter-natalie-samantha-rupnow-female-trans-rcna184584\"\u003esaid\u003c/a\u003e to NBC News, only about a tenth of 1% of such cases over the previous decade have allegedly been carried out by trans people.\u003c/p\u003e \u003ca href=\"https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate\"\u003eContinue reading...\u003c/a\u003e",
                      "published_at":  "2025-09-14T19:53:00+00:00",
                      "source":  "World news | The Guardian",
                      "clickbait_prob":  0.0037037037037037034,
                      "ragebait_prob":  0.008641975308641974,
                      "score":  99.48148148148148
                  }
              ]
}
